app/views/users/index.html.erb

          <div class="col-xs-6">
            <input type="text" ng-model="newUser.first_name" class="form-control" placeholder="First Name" />
---
SELECT `users`.* FROM `users`