app/controllers/users_controller.rb

SELECT `users`.* FROM `users`
---
  def index
    respond_to do |format|
      format.json { render json: User.all }

INSERT INTO `users` (`first_name`, `last_name`, `email`, `phone_no`, `address`, `dob`, `created_at`, `updated_at`) VALUES ('hetal', 'khunti', 'hetal@briskbrain.com', 123456789, 'ahemedabad', '2010-08-13', '2015-08-13 12:58:06', '2015-08-13 12:58:06')
---
  def create
    @user = User.create(visitor_params)

DELETE FROM `users` WHERE `users`.`id` = 1
---
  def destroy
    respond_with User.destroy(params[:id])